code-review/NRB_3471_3546/База_Было/DataProcessors/ПроверкаДоставкиУведомленийВКабинетКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаДоставкиУведомленийВКабинетКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Уведомления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументУведомления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявлениеНаУчастиеВОферте</v8:Type>
								<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
								<v8:Type>cfg:DocumentRef.УведомлениеКлиентам</v8:Type>
								<v8:Type>cfg:BusinessProcessRef.ОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УникальныйИдентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусДоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыДоставкиУведомленийВКабинетКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СтатусыДоставкиУведомленийВКабинетКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДоставкиУведомленийВКабинетКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгруженИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженВКабинетКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбойОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ЗаявлениеНаУчастиеВОферте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаУчастиеВОферте</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерСЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОферты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КарточкаОферты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КарточкаОферты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЦБ</Name>
					<Comment>Количество ценных бумаг, предъявляемых к оферте</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОПриемеКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияВКабинетеКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ПроверкаДоставкиУведомленийВКабинетКлиента/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

Перем ОбработкаВебСервисы Экспорт;

// Заполняет переменную модуля "ОбработкаВебСервисы"
// Вызов не обязателен.
Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
	ВнешниеДанные.ИнициироватьСоединение(ОбработкаВебСервисы, "ВебСервисы", Параметры);
КонецПроцедуры

// Заполняет таб. часть "Уведомления" данными со статусом "ВыгруженИз1С" за период
Процедура ЗаполнитьУведомленияВыгруженныеИз1С(пНачалоПериода, пКонецПериода) Экспорт
		
	ЭтотОбъект.НачалоПериода = пНачалоПериода;
	ЭтотОбъект.КонецПериода = пКонецПериода;
	ЗаполнитьУведомленияПоСтатусам(Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С);
	
	Если НЕ РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("ДоработкаWEBПовторногоГолосованияКлиента",Ложь) Тогда		
		
		ИсключитьПовторныеУведомленияОГолосовании();		
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет таб. часть "Уведомления" данными со статусом "ВыгруженИз1С" и "СбойОтправки" за период
//
// Параметры:
//  ДатаНачала		 - Дата - Начало периода для отбора уведомлений
//  ДатаОкончания	 - Дата - Окончание периода для отбора уведомлений
//
Процедура ЗаполнитьУведомленияВыгруженныеИз1СИСбойОтправки(ДатаНачала, ДатаОкончания) Экспорт
	
	НачалоПериода = ДатаНачала;
	КонецПериода = ДатаОкончания;
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С);
	Статусы.Добавить(Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.СбойОтправки);
	ЗаполнитьУведомленияПоСтатусам(Статусы);
	
КонецПроцедуры

// Заполняет таб. часть "Уведомления" данными с любым статусом за период
Процедура ЗаполнитьВсеУведомления(пНачалоПериода, пКонецПериода) Экспорт
	ЭтотОбъект.НачалоПериода = пНачалоПериода;
	ЭтотОбъект.КонецПериода = пКонецПериода;
	
	Статусы = Новый Массив;
	Для Каждого Элемент Из Метаданные.Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ЗначенияПеречисления Цикл
		Статусы.Добавить(Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента[Элемент.Имя]);
	КонецЦикла;
	Статусы.Добавить(Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ПустаяСсылка());
	
	ЗаполнитьУведомленияПоСтатусам(Статусы);
КонецПроцедуры

// Загружает в таб.часть "Уведомления" статусы доставки уведомлений о корпоративных действиях
// Возвращаемое значение:
//	булево - Истина, если удалось выполнить загрузку, иначе Ложь
Функция РезультатЗагрузкиСтатусовДоставкиУведомлений() Экспорт
	Если Уведомления.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИдентификаторыУведомлений = Уведомления.Выгрузить(, "УникальныйИдентификатор");
	ИдентификаторыУведомлений.Свернуть("УникальныйИдентификатор");
	ИдентификаторыУведомлений = ИдентификаторыУведомлений.ВыгрузитьКолонку("УникальныйИдентификатор");
	
	ДанныеУведомлений = Новый ТаблицаЗначений;
	ДанныеУведомлений.Колонки.Добавить("УникальныйИдентификатор");
	ДанныеУведомлений.Колонки.Добавить("ИдентификаторыКлиентов");
	
	Для Каждого Идентификатор Из ИдентификаторыУведомлений Цикл
		Отбор = Новый Структура("УникальныйИдентификатор, СтатусДоставки", Идентификатор,
			Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С);
		СтрокиТЧУведомления = Уведомления.НайтиСтроки(Отбор);
		
		НоваяСтрока = ДанныеУведомлений.Добавить();
		НоваяСтрока.УникальныйИдентификатор = Идентификатор;
		НоваяСтрока.ИдентификаторыКлиентов = КодыЗагрузкиКлиентов(СтрокиТЧУведомления);
	КонецЦикла;
	
	СтатусыДоставки = ВебСервисыСервер.СтатусыДоставкиУведомленийОКД(ДанныеУведомлений, ОбработкаВебСервисы);
	Если СтатусыДоставки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаСтатуса Из СтатусыДоставки Цикл
		Отбор = Новый Структура("УникальныйИдентификатор, КодЗагрузки, СтатусДоставки", СтрокаСтатуса.GUID,
			СтрокаСтатуса.ClientId, Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С);
		СтрокиТЧУведомления = Уведомления.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧУведомления Из СтрокиТЧУведомления Цикл
			Если СтрокаСтатуса.Успешно Тогда
				СтрокаТЧУведомления.СтатусДоставки = Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ЗагруженВКабинетКлиента;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// Загружает в таб.часть "Уведомления" данные, имеющиеся в СУДК, но отсутствующие в 1С
// Возвращаемое значение:
//	булево - Истина, если удалось выполнить загрузку, иначе Ложь
Функция РезультатЗагрузкиУведомленийОтсутствующихВ1С() Экспорт
	ИдентификаторыУведомлений = Уведомления.Выгрузить(, "УникальныйИдентификатор");
	ИдентификаторыУведомлений.Свернуть("УникальныйИдентификатор");
	ИдентификаторыУведомлений = ИдентификаторыУведомлений.ВыгрузитьКолонку("УникальныйИдентификатор");
	
	ДанныеУведомлений = Новый ТаблицаЗначений;
	ДанныеУведомлений.Колонки.Добавить("УникальныйИдентификатор");
	ДанныеУведомлений.Колонки.Добавить("ИдентификаторыКлиентов");
	
	Для Каждого Идентификатор Из ИдентификаторыУведомлений Цикл
		Отбор = Новый Структура("УникальныйИдентификатор", Идентификатор);
		СтрокиТЧУведомления = Уведомления.НайтиСтроки(Отбор);
		
		НоваяСтрока = ДанныеУведомлений.Добавить();
		НоваяСтрока.УникальныйИдентификатор = Идентификатор;
		НоваяСтрока.ИдентификаторыКлиентов = КодыЗагрузкиКлиентов(СтрокиТЧУведомления);
	КонецЦикла;
	
	ОтсутствующиеУведомления = ВебСервисыСервер.УведомленияКДОтстутствующиеВ1С(ДанныеУведомлений, НачалоПериода,
		КонецПериода, ОбработкаВебСервисы);
	Если ОтсутствующиеУведомления = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодыКлиентов = ОтсутствующиеУведомления.Скопировать(, "ClientId");
	КодыКлиентов.Свернуть("ClientId");
	КодыКлиентов = КодыКлиентов.ВыгрузитьКолонку("ClientId");
	Клиенты = КлиентыПоКодамЗагрузки(КодыКлиентов);
	
	Для Каждого Строка Из ОтсутствующиеУведомления Цикл
		НоваяСтрока = Уведомления.Добавить();
		НоваяСтрока.УникальныйИдентификатор = Строка.GUID;
		НоваяСтрока.КодЗагрузки = Строка.ClientId;
		НоваяСтрока.Клиент = Клиенты[Строка.ClientId];
		НоваяСтрока.СтатусДоставки = Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ПустаяСсылка();
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Процедура УстановитьСтатусЗагруженВРегистреУведомлений() Экспорт
	Отбор = Новый Структура("СтатусДоставки", Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ЗагруженВКабинетКлиента);
	СтрокиСтатусЗагружен = Уведомления.НайтиСтроки(Отбор);
	Для Каждого Строка Из СтрокиСтатусЗагружен Цикл
		РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.УстановитьСтатусДоставки(
			Строка.ДокументУведомления, Строка.Клиент, Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С,
			Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ЗагруженВКабинетКлиента);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьВЖурналРегистрацииОшибкиДоставкиУведомлений() Экспорт
	Для Каждого Строка Из Уведомления Цикл
		ЗаписьЖурналаРегистрации("Проверка доставки уведомлений в кабинет клиента", УровеньЖурналаРегистрации.Ошибка,,
			Строка.Клиент, "Не загружено уведомление в кабинет клиента по документу " + Строка.ДокументУведомления);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьВЖурналРегистрацииОшибкиОтсутствияУведомлений() Экспорт
	Отбор = Новый Структура("ДокументУведомления", Документы.УведомлениеКлиентам.ПустаяСсылка());
	СтрокиБезДокумента = Уведомления.НайтиСтроки(Отбор);
	
	УИДы = Новый Массив;
	
	Для Каждого Строка Из СтрокиБезДокумента Цикл
		Если УИДы.Найти(Строка.УникальныйИдентификатор) = Неопределено Тогда
			УИДы.Добавить(Строка.УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УникальныйИдентификатор Из УИДы Цикл
		ЗаписьЖурналаРегистрации("Проверка отсутствующих уведомлений", УровеньЖурналаРегистрации.Ошибка,,
			УникальныйИдентификатор, "Уникальный идентификатор документа обнаружен в СУДК, но отсутствует в 1С");
	КонецЦикла;
КонецПроцедуры

Процедура ОтправитьСообщениеОНедоставленныхУведомлениях() Экспорт
	ОтправитьСообщениеПоЭлПочте("Уведомления, не доставленные в кабинет клиента",
		HTMLТекстПисьмаОНедоставленныхУведомлениях());
КонецПроцедуры

Процедура ОтправитьСообщениеОбОтсутствующихУведомлениях() Экспорт
	ОтправитьСообщениеПоЭлПочте("Уведомления СУДК, отсутствующие в 1С", HTMLТекстПисьмаОбОтсутствующихУведомлениях());
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает массив неповторяющихся кодов загрузки клиентов из переданных строк таб.части обработки
//
// Параметры:
//	СтрокиТабЧастиУведомления - массив строк таб.части "Уведомления"
// Возвращаемое значение:
//	массив строк - неповторяющихся кодов загрузки
Функция КодыЗагрузкиКлиентов(СтрокиТабЧастиУведомления)
	Коды = Новый Массив;
	Для Каждого Строка Из СтрокиТабЧастиУведомления Цикл
		Если Коды.Найти(Строка.КодЗагрузки) = Неопределено Тогда
			Коды.Добавить(Строка.КодЗагрузки);
		КонецЕсли;
	КонецЦикла;
	Возврат Коды;
КонецФункции

// Заполняет таб. часть "Уведомления" по записям РС УведомленияОтправленныеЧерезЛичныйКабинет за период из обработки
// с отбором по статусам
//
// Параметры:
//	Статусы - массив или один элемент перечисления СтатусыДоставкиУведомленийВКабинетКлиента
Процедура ЗаполнитьУведомленияПоСтатусам(Статусы)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегистрУведомлений.КД КАК ДокументУведомления,
	|	РегистрУведомлений.Клиент КАК Клиент,
	|	КодыЗагрузки.Код КАК КодЗагрузки,
	|	РегистрУведомлений.СтатусДоставкиУведомления КАК СтатусДоставки,
	|	РегистрУведомлений.ИдентификаторУведомления КАК УникальныйИдентификатор
	|ИЗ
	|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК РегистрУведомлений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО РегистрУведомлений.Клиент = КодыЗагрузки.Владелец
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.Биржа = &КлассификаторыЗагрузки)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &КонецПериода)
	|ГДЕ
	|	РегистрУведомлений.СтатусДоставкиУведомления В(&Статусы)
	|	И РегистрУведомлений.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВЫБОР
	|			КОГДА РегистрУведомлений.КД ССЫЛКА Документ.ЗаявлениеНаУчастиеВОферте
	|				ТОГДА ИСТИНА
	|			КОГДА РегистрУведомлений.КД ССЫЛКА Документ.УведомлениеКлиентам
	|					И ВЫРАЗИТЬ(РегистрУведомлений.КД КАК Документ.УведомлениеКлиентам).Дата <= &КонецПериода
	|				ТОГДА ИСТИНА
	|			КОГДА РегистрУведомлений.КД ССЫЛКА Документ.СводныйОтчетОСовершенныхОперациях
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрУведомлений.КД.Дата,
	|	РегистрУведомлений.Клиент.Наименование");
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КлассификаторыЗагрузки", Справочники.КлассификаторыЗагрузки.CrmContractNumber);
	Уведомления.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого ДанныеУведомления Из Уведомления Цикл
		ДанныеУведомления.КодЗагрузки = СокрЛП(ДанныеУведомления.КодЗагрузки);
	КонецЦикла;
КонецПроцедуры

Процедура ИсключитьПовторныеУведомленияОГолосовании()
	
	ТаблицаУведомлений = Уведомления.Выгрузить();
	ТаблицаУведомлений.Свернуть("ДокументУведомления");
	
	Для каждого Стр из ТаблицаУведомлений Цикл
		
		ДокументУведомления = Стр.ДокументУведомления;
		Если ТипЗнч(ДокументУведомления) = Тип("ДокументСсылка.СводныйОтчетОСовершенныхОперациях") Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНайти(ДокументУведомления.ТелоСообщения,"#СсылкаДляУчастияВГолосовании#",НаправлениеПоиска.СКонца) <> 0 Тогда
			
			Удалить = ЗапросПодчиненныхУведомлений(ДокументУведомления);
			
			Если Удалить <> Неопределено Тогда
				
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("ДокументУведомления",ДокументУведомления);
				НайденныеУведомления = Уведомления.НайтиСтроки(ПараметрыОтбора);

				Для каждого Увед из НайденныеУведомления Цикл
					Уведомления.Удалить(Увед);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗапросПодчиненныхУведомлений(УведомлениеКлиентам)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УведомлениеКлиентам.ДокументОснование КАК ДокументОснование,
		|	УведомлениеКлиентам.Ссылка КАК Уведомление
		|ПОМЕСТИТЬ втДокументОснование
		|ИЗ
		|	Документ.УведомлениеКлиентам КАК УведомлениеКлиентам
		|ГДЕ
		|	УведомлениеКлиентам.Ссылка = &УведомлениеКлиентам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеКлиентам.Ссылка КАК Ссылка
		|ИЗ
		|	втДокументОснование КАК втДокументОснование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеКлиентам КАК УведомлениеКлиентам
		|		ПО втДокументОснование.ДокументОснование = УведомлениеКлиентам.ДокументОснование
		|ГДЕ
		|	УведомлениеКлиентам.СозданаСтраницаГолосованияВКабинетеКлиента
		|	И втДокументОснование.Уведомление <> УведомлениеКлиентам.Ссылка";
	
	Запрос.УстановитьПараметр("УведомлениеКлиентам", УведомлениеКлиентам);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Возврат Истина;
			
	КонецЕсли;
	
КонецФункции

// Получает по кодам загрузки клиентов ссылки на спр. Контрагенты
//
// Параметры:
//	КодыКлиентов - массив строк - кодов загрузки клиентов
//
// Возвращаемое значение:
//	соответствие КодЗагрузки-Клиент
Функция КлиентыПоКодамЗагрузки(КодыКлиентов)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КодыЗагрузки.Владелец КАК Клиент,
	|	КодыЗагрузки.Код КАК КодЗагрузки
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	НЕ КодыЗагрузки.ПометкаУдаления
	|	И КодыЗагрузки.Биржа = &КлассификаторыЗагрузкиКлиенты
	|	И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &КонецПериода)
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.Контрагенты
	|	И КодыЗагрузки.Код В(&КодыКлиентов)");
	Запрос.УстановитьПараметр("КодыКлиентов", КодыКлиентов);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Клиенты = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Клиенты.Вставить(СокрЛП(Выборка.КодЗагрузки), Выборка.Клиент);
	КонецЦикла;
	Возврат Клиенты;
КонецФункции

Функция HTMLТекстПисьмаОНедоставленныхУведомлениях()
	Строки = Новый Массив;
	
	Если Уведомления.Количество() = 0 Тогда
		Текст = "<p>За период с %1 по %2 <strong>доставлены все</strong> уведомления.</p>";
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ЭтотОбъект.НачалоПериода,
			ЭтотОбъект.КонецПериода);
		Строки.Добавить(Текст);
	Иначе
		Текст = "<p>За период с %1 по %2 <strong>не доставлены</strong> уведомления:</p>";
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ЭтотОбъект.НачалоПериода,
			ЭтотОбъект.КонецПериода);
		Строки.Добавить(Текст);
		
		Строки.Добавить("<table border=""1"" cellpadding=""5"" cellspacing=""0"" bordercolor=""gray"">");
		Строки.Добавить(
		"<tr>
		|<td>Документ уведомления</td>
		|<td>GUID</td>
		|<td>ContractNumber</td>
		|<td>Текущий статус</td>
		|</tr>");
		Для Каждого ДанныеУведомления Из Уведомления Цикл
			Текст =
			"<tr>
			|<td>%1</td>
			|<td>%2</td>
			|<td>%3</td>
			|<td>%4</td>
			|</tr>";
			Строки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст,
				СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.ДокументУведомления)),
				СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.УникальныйИдентификатор)),
				СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.КодЗагрузки)),
				СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.СтатусДоставки))));
		КонецЦикла;
		Строки.Добавить("</table>");
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Строки, Символы.ПС);
КонецФункции

Функция HTMLТекстПисьмаОбОтсутствующихУведомлениях()
	Строки = Новый Массив;
	
	Отбор = Новый Структура("ДокументУведомления", Документы.УведомлениеКлиентам.ПустаяСсылка());
	СтрокиУведомлений = Уведомления.НайтиСтроки(Отбор);
	Если СтрокиУведомлений.Количество() = 0 Тогда
		Текст = "<p>За период с %1 по %2 <strong>не обнаружено</strong> уведомлений СУДК, отсутствующих в 1С.</p>";
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ЭтотОбъект.НачалоПериода,
			ЭтотОбъект.КонецПериода);
		Строки.Добавить(Текст);
	Иначе
		Текст = "<p>За период с %1 по %2 <strong>обнаружены</strong> уведомления СУДК, отсутствующие в 1С:</p>";
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ЭтотОбъект.НачалоПериода,
			ЭтотОбъект.КонецПериода);
		Строки.Добавить(Текст);
		
		Строки.Добавить("<table border=""1"" cellpadding=""5"" cellspacing=""0"" bordercolor=""gray"">");
		Строки.Добавить(
		"<tr>
		|<td>GUID</td>
		|<td>Клиент</td>
		|<td>Client ID</td>
		|</tr>");
		Для Каждого ДанныеУведомления Из СтрокиУведомлений Цикл
			Текст =
			"<tr>
			|<td>%1</td>
			|<td>%2</td>
			|<td>%3</td>
			|</tr>";
			Строки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст,
				СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.УникальныйИдентификатор)),
				СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.Клиент.Код)),
				СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.КодЗагрузки))));
		КонецЦикла;
		Строки.Добавить("</table>");
		
		Если Уведомления.Количество() > СтрокиУведомлений.Количество() Тогда
			Строки.Добавить("<p>Уведомления, выгруженные из 1С/загруженные в кабинет клиента за период:</p>");
			Строки.Добавить("<table border=""1"" cellpadding=""5"" cellspacing=""0"" bordercolor=""gray"">");
			Строки.Добавить(
			"<tr>
			|<td>Документ уведомления</td>
			|<td>GUID</td>
			|<td>Клиент</td>
			|<td>Client ID</td>
			|<td>Статус</td>
			|</tr>");
			Для Каждого ДанныеУведомления Из Уведомления Цикл
				Если НЕ ЗначениеЗаполнено(ДанныеУведомления.ДокументУведомления) Тогда
					Продолжить;
				КонецЕсли;
				
				Текст =
				"<tr>
				|<td>%1</td>
				|<td>%2</td>
				|<td>%3</td>
				|<td>%4</td>
				|<td>%5</td>
				|</tr>";
				Строки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст,
					СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.ДокументУведомления)),
					СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.УникальныйИдентификатор)),
					СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.Клиент.Код)),
					СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.КодЗагрузки)),
					СокрЛП(СтроковыеФункцииКлиентСервер.HTMLСтрока(ДанныеУведомления.СтатусДоставки))));
			КонецЦикла;
			Строки.Добавить("</table>");
		Иначе
			Строки.Добавить("<p>Нет уведомлений, выгруженных из 1С или загруженных в кабинет клиента за период.</p>");			
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Строки, Символы.ПС);
КонецФункции

Процедура ОтправитьСообщениеПоЭлПочте(ТемаПисьма, ТекстПисьма)
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаОтчетовОДоставкеУведомленийВКК;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	
	Если НастройкиОбмена = Неопределено Тогда
		ТекстОшибки = "Не заданы параметры внешнего источника " + ВнешнийИсточник;
		#Если Клиент Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
		#КонецЕсли
		ИмяСобытия = "Рассылка отчетов о доставке уведомлений в КК";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ВнешнийИсточник, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);				
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
